In [1]:
import pandas as pd
import numpy as np
import random
print("Hello World ~Matt Goeckel")

Hello World ~Matt Goeckel

In [4]:
##Part 2.4
grades_dict = {'Matt': [87, 96, 70], 'Bobby': [100, 87, 90],
            'Bearcat': [94, 77, 90], 'Corky': [100, 81, 82],
             'Cowboy': [83, 65, 85]}
grades = pd.DataFrame(grades_dict)
grades

   Matt  Bobby  Bearcat  Corky  Cowboy
0    87    100       94    100      83
1    96     87       77     81      65
2    70     90       90     82      85

In [5]:
##Part 2.5
grades.index = ['Exam1', 'Exam2', 'Exam3']
grades

       Matt  Bobby  Bearcat  Corky  Cowboy
Exam1    87    100       94    100      83
Exam2    96     87       77     81      65
Exam3    70     90       90     82      85

In [6]:
##Part 2.6
grades['Bearcat']

Exam1    94
Exam2    77
Exam3    90
Name: Bearcat, dtype: int64

In [7]:
##Part 2.7
grades.Corky

Exam1    100
Exam2     81
Exam3     82
Name: Corky, dtype: int64

In [11]:
##Part 2.8
grades.loc['Exam1']     #I prefer this one since you can call on the name that you set

Matt        87
Bobby      100
Bearcat     94
Corky      100
Cowboy      83
Name: Exam1, dtype: int64

In [10]:
grades.iloc[1]

Matt       96
Bobby      87
Bearcat    77
Corky      81
Cowboy     65
Name: Exam2, dtype: int64

In [12]:
##Part 2.10
grades.at['Exam2', 'Bobby']

87

In [13]:
##Part 2.11
grades.iat[2,0]

70

In [14]:
##Part 2.12
grades.describe()

            Matt       Bobby    Bearcat       Corky     Cowboy
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [17]:
##Part 2.13
pd.set_option('display.precision',2)
grades.describe()

        Matt   Bobby  Bearcat   Corky  Cowboy
count   3.00    3.00     3.00    3.00    3.00
mean   84.33   92.33    87.00   87.67   77.67
std    13.20    6.81     8.89   10.69   11.02
min    70.00   87.00    77.00   81.00   65.00
25%    78.50   88.50    83.50   81.50   74.00
50%    87.00   90.00    90.00   82.00   83.00
75%    91.50   95.00    92.00   91.00   84.00
max    96.00  100.00    94.00  100.00   85.00

In [18]:
##Part 2.14
grades.mean()

Matt       84.33
Bobby      92.33
Bearcat    87.00
Corky      87.67
Cowboy     77.67
dtype: float64

In [19]:
##Part 2.15
grades.sort_index(ascending=False)

       Matt  Bobby  Bearcat  Corky  Cowboy
Exam3    70     90       90     82      85
Exam2    96     87       77     81      65
Exam1    87    100       94    100      83

In [20]:
##Part 2.16
grades.sort_index(axis=1)

       Bearcat  Bobby  Corky  Cowboy  Matt
Exam1       94    100    100      83    87
Exam2       77     87     81      65    96
Exam3       90     90     82      85    70

In [21]:
print("Matt Goeckel has completed Project Part 2 :)")

Matt Goeckel has completed Project Part 2 :)